app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%%' ESCAPE '!'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%%' ESCAPE '!'
 LIMIT 6
---
    public function index()
    {
        $q = $this->request->getVar('q') ?? '';

        $data = [
            'title'   => 'Daftar Artikel',
            'q'       => $q,
            'artikel' => $this->artikelModel->select('artikel.*, kategori.nama_kategori')
                            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                            ->like('artikel.judul', $q)
                            ->paginate(6, 'artikel'),

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`slug` = 'eksplorasi-tren-warna-pastel-dan-gradasi-lembut-dalam-desain-web-modern'
 LIMIT 1
---
    public function view($slug = null)
    {
        // 1. PENGAMAN UTAMA: Jika slug kosong atau bernilai index.php karena bug server local, kembalikan ke index
        if (empty($slug) || $slug === 'index.php') {
            return redirect()->to('/artikel');
        }

        // Bersihkan data parameter string
        $slug = trim(esc($slug));

        // 2. QUERY UTAMA: Cari artikel berdasarkan kolom slug data
        $artikel = $this->artikelModel->select('artikel.*, kategori.nama_kategori')
                                      ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                                      ->where('artikel.slug', $slug)
                                      ->first();

SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10
---
    public function admin_index()
    {
        $title = 'Halaman Admin - Artikel';

        // Ambil parameter dari request AJAX atau URL
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        // Query Builder
        $builder = $this->artikelModel->table('artikel')
                        ->select('artikel.*, kategori.nama_kategori')
                        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        // Logika Pencarian
        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        // Logika Filter Kategori
        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        // Ambil data dengan pagination
        $artikel = $builder->paginate(10, 'artikel', $page);

SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
            'q'           => $q,
            'kategori_id' => $kategori_id,
            'artikel'     => $artikel,
            'pager'       => $this->artikelModel->pager->makeLinks($page, 10, $this->artikelModel->countAllResults(false), 'default_full')

SELECT *
FROM `kategori`
---
            return $this->response->setJSON($data);
        } else {
            // Jika bukan AJAX (pemuatan halaman biasa), ambil data kategori untuk dropdown
            $data['kategori'] = $this->kategoriModel->findAll();

SELECT *
FROM `kategori`
---
    public function add()
    {
        if ($this->request->is('post')) {
            $fileGambar = $this->request->getFile('gambar');
            $namaGambar = null;

            if ($fileGambar && $fileGambar->isValid() && !$fileGambar->hasMoved()) {
                $namaGambar = $fileGambar->getRandomName();
                $fileGambar->move('uploads', $namaGambar);
            }

            $this->artikelModel->save([
                'judul'       => $this->request->getPost('judul'),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'isi'         => $this->request->getPost('isi'),
                'status'      => $this->request->getPost('status') ?? 1,
                'gambar'      => $namaGambar,
                'slug'        => url_title($this->request->getPost('judul'), '-', true)
            ]);

            session()->setFlashdata('pesan', 'Artikel berhasil diterbitkan!');
            return redirect()->to('/admin/artikel');
        }

        return view('admin/artikel_add', [
            'title'    => 'Tambah Artikel',
            'kategori' => $this->kategoriModel->findAll()