app/Controllers/User.php

    public function login()
    {
        $data = [
            'title' => 'Login Admin',
        ];

        // Jika ada pengiriman data (tombol login diklik)
        if ($this->request->is('post')) {
            $model = new UserModel();
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            // Cari user berdasarkan kolom 'useremail' di database
            $user = $model->where('useremail', $email)->first();
---
SELECT *
FROM `user`
WHERE `useremail` = 'admin@email.com'
 LIMIT 1